Orgall/2021-01-15.org
#+title: 2021-01-15

* 百词斩
- immoral
- absolve 避免被解决
- legion 军团
- [[file:2021011411-screwdriver.org][screwdriver]]
- debut 初次登台的,联想到姚明
- flutter flur 飘动的
- [[file:2021011511-overcast.org][overcast]] forecast 过度天气预报的
- [[file:2021011511-bourgeois.org][bourgeois]]
- [[file:2021011511-gist.org][gist]]
- ore 矿石
- [[file:2021011511-aristocrat.org][aristocrat]] aristo 配合 , crat 统治,权利
- [[file:2021011511-omen.org][omen]] 征兆,预兆 [[file:2021011511-amen.org][amen]]
- def 挑战 i+ ance , defiance 挑战,蔑视
- [[file:2021011511-plenary.org][plenary]] 充分的,全体出席的 plenty
- freight 货运,运费,运送
- [[file:2021011511-speciality.org][speciality]] 专长
- [[file:2021011511-flint.org][flint]]  fl for fly int for integer, 火花四射,打火石
- glorify 赞美,赞扬
- [[file:2021011412-abruptly.org][abruptly]]
- pepper 胡椒
- prophet 在前说出的,预言
- wage 薪水,报酬
- flavor 味,风味,调味品
- paperwork 文书工作
- rational 理性的,理智的
- [[file:2021011511-gild.org][gild]] 镀金 gold 金
- voucher 代金卷
- [[file:2021011511-gloves.org][gloves]] 手套
- insulation 绝缘隔离, [[file:2021011511-insul.org][insul]] [[file:2021011511-peninsula.org][peninsula]]
- [[file:2020112515-courteous.org][courteous]] 有礼貌的,谦恭有礼的
- jolly 愉快的,欢乐的 联想到安卓上有款app
- [[file:2021011511-mediterranean.org][mediterranean]]
- bleat 羔羊咩咩叫, [[file:2021011511-lambs.org][lambs]] 羔羊, 沉默的羔羊, the silence of the lambs
- [[file:2021011511-pavement.org][pavement]]
- [[file:2021011511-dough.org][dough]] 生面团 [[file:2021011511-flour.org][flour]]
- [[file:2021011511-grime.org][grime]] 尘垢 [[file:2021011511-rime.org][rime]]
- [[file:2021011511-takeover.org][takeover]] 接受,接管.接任,收买 take 拿,over过来
- toothpaste [[file:2021011511-paste.org][paste]] 浆糊,黏土
- [[file:2020112110-tactless.org][tactless]] [[file:2021011511-tactical.org][tactical]]
- detergent 洗涤剂,清洁剂  deterge 擦净,ent药剂
- [[file:2021011511-loosen.org][loosen]] fasten
- consolidate 巩固,加强
- mattress 床垫 mat垫子+t+ress表名词
- combustion 共同的,bust 爆裂, ion抽象名词
- [[file:2020112108-dignity.org][dignity]] dign 值得,高贵的
- congregate con-共同的,greg集合,ate动词后缀
- [[file:2021011512-compensate.org][compensate]] 赔偿
- [[file:2021011512-duly.org][duly]]
- salute 向....敬礼
- [[file:2021011512-pane.org][pane]] 窗玻璃.方框,方格 [[file:2021011512-panel.org][panel]]
- [[file:2021011512-antique.org][antique]]
- [[file:2021011512-rubies.org][rubies]]
- testament 确实的
- [[file:2021011512-compensate.org][compensate]]
- [[file:2021011512-urban.org][urban]] [[file:2021011512-suburban.org][suburban]] [[file:2021011512-rural.org][rural]] [[file:2021011512-countryside.org][countryside]]
- shrewd 精明的,机灵的
- [[file:2021011512-textile.org][textile]] 编织 [[file:2021010715-weave.org][weave]]
- [[file:2021011512-moist.org][moist]] and [[file:2021011512-humidity.org][humidity]]
- [[file:2021011512-valiant.org][valiant]] 勇敢的,英勇的,勇士
- [[file:2021011512-stern.org][stern]] 严厉的,严峻的,苛刻的,坚决的
- coinage
- [[file:2021011512-cozy.org][cozy]] [[file:2021011512-den.org][den]] 贼窝
- [[file:2021011512-brewery.org][brewery]] 啤酒厂 brew
- [[file:2021011512-disillusion.org][disillusion]] 幻灭,给....泼冷水 illusion 光明,幻觉
- [[file:2021011512-acrobat.org][acrobat]] 杂技演员
- [[file:2021011512-chauffeur.org][chauffeur]] 司机,开车,运输
- worship 崇拜,爱戴
- canal 运河
- enterprise enter 进入 ,prise 拿住,抓住 entrepreneur

* [[file:Robbins Basic Pathology 10th Edition 2017.org][Robbins Basic Pathology 10th Edition 2017]]
- [[file:2021011515-striated.org][striated]] 条纹的,联想到斑马线,条纹
- 
