www/content/posts/2021-01-15.md
+++
title = "2021-01-15"
author = ["邓蔚竹"]
draft = false
+++

## 百词斩 {#百词斩}

-   immoral
-   absolve 避免被解决
-   legion 军团
-   [screwdriver]({{< relref "2021011411-screwdriver" >}})
-   debut 初次登台的,联想到姚明
-   flutter flur 飘动的
-   [overcast]({{< relref "2021011511-overcast" >}}) forecast 过度天气预报的
-   [bourgeois]({{< relref "2021011511-bourgeois" >}})
-   [gist]({{< relref "2021011511-gist" >}})
-   ore 矿石
-   [aristocrat]({{< relref "2021011511-aristocrat" >}}) aristo 配合 , crat 统治,权利
-   [omen]({{< relref "2021011511-omen" >}}) 征兆,预兆 [amen]({{< relref "2021011511-amen" >}})
-   def 挑战 i+ ance , defiance 挑战,蔑视
-   [plenary]({{< relref "2021011511-plenary" >}}) 充分的,全体出席的 plenty
-   freight 货运,运费,运送
-   [speciality]({{< relref "2021011511-speciality" >}}) 专长
-   [flint]({{< relref "2021011511-flint" >}})  fl for fly int for integer, 火花四射,打火石
-   glorify 赞美,赞扬
-   [abruptly]({{< relref "2021011412-abruptly" >}})
-   pepper 胡椒
-   prophet 在前说出的,预言
-   wage 薪水,报酬
-   flavor 味,风味,调味品
-   paperwork 文书工作
-   rational 理性的,理智的
-   [gild]({{< relref "2021011511-gild" >}}) 镀金 gold 金
-   voucher 代金卷
-   [gloves]({{< relref "2021011511-gloves" >}}) 手套
-   insulation 绝缘隔离, [insul]({{< relref "2021011511-insul" >}}) [peninsula]({{< relref "2021011511-peninsula" >}})
-   [courteous]({{< relref "2020112515-courteous" >}}) 有礼貌的,谦恭有礼的
-   jolly 愉快的,欢乐的 联想到安卓上有款app
-   [mediterranean]({{< relref "2021011511-mediterranean" >}})
-   bleat 羔羊咩咩叫, [lambs]({{< relref "2021011511-lambs" >}}) 羔羊, 沉默的羔羊, the silence of the lambs
-   [pavement]({{< relref "2021011511-pavement" >}})
-   [dough]({{< relref "2021011511-dough" >}}) 生面团 [flour]({{< relref "2021011511-flour" >}})
-   [grime]({{< relref "2021011511-grime" >}}) 尘垢 [rime]({{< relref "2021011511-rime" >}})
-   [takeover]({{< relref "2021011511-takeover" >}}) 接受,接管.接任,收买 take 拿,over过来
-   toothpaste [paste]({{< relref "2021011511-paste" >}}) 浆糊,黏土
-   [tactless]({{< relref "2020112110-tactless" >}}) [tactical]({{< relref "2021011511-tactical" >}})
-   detergent 洗涤剂,清洁剂  deterge 擦净,ent药剂
-   [loosen]({{< relref "2021011511-loosen" >}}) fasten
-   consolidate 巩固,加强
-   mattress 床垫 mat垫子+t+ress表名词
-   combustion 共同的,bust 爆裂, ion抽象名词
-   [dignity]({{< relref "2020112108-dignity" >}}) dign 值得,高贵的
-   congregate con-共同的,greg集合,ate动词后缀
-   [compensate]({{< relref "2021011512-compensate" >}}) 赔偿
-   [duly]({{< relref "2021011512-duly" >}})
-   salute 向....敬礼
-   [pane]({{< relref "2021011512-pane" >}}) 窗玻璃.方框,方格 [panel]({{< relref "2021011512-panel" >}})
-   [antique]({{< relref "2021011512-antique" >}})
-   [rubies]({{< relref "2021011512-rubies" >}})
-   testament 确实的
-   [compensate]({{< relref "2021011512-compensate" >}})
-   [urban]({{< relref "2021011512-urban" >}}) [suburban]({{< relref "2021011512-suburban" >}}) [rural]({{< relref "2021011512-rural" >}}) [countryside]({{< relref "2021011512-countryside" >}})
-   shrewd 精明的,机灵的
-   [textile]({{< relref "2021011512-textile" >}}) 编织 [weave]({{< relref "2021010715-weave" >}})
-   [moist]({{< relref "2021011512-moist" >}}) and [humidity]({{< relref "2021011512-humidity" >}})
-   [valiant]({{< relref "2021011512-valiant" >}}) 勇敢的,英勇的,勇士
-   [stern]({{< relref "2021011512-stern" >}}) 严厉的,严峻的,苛刻的,坚决的
-   coinage
-   [cozy]({{< relref "2021011512-cozy" >}}) [den]({{< relref "2021011512-den" >}}) 贼窝
-   [brewery]({{< relref "2021011512-brewery" >}}) 啤酒厂 brew
-   [disillusion]({{< relref "2021011512-disillusion" >}}) 幻灭,给....泼冷水 illusion 光明,幻觉
-   [acrobat]({{< relref "2021011512-acrobat" >}}) 杂技演员
-   [chauffeur]({{< relref "2021011512-chauffeur" >}}) 司机,开车,运输
-   worship 崇拜,爱戴
-   canal 运河
-   enterprise enter 进入 ,prise 拿住,抓住 entrepreneur


## [Robbins Basic Pathology 10th Edition 2017]({{< relref "Robbins Basic Pathology 10th Edition 2017" >}}) {#robbins-basic-pathology-10th-edition-2017--robbins-basic-pathology-10th-edition-2017-dot-md}

-   [striated]({{< relref "2021011515-striated" >}}) 条纹的,联想到斑马线,条纹
-